Repository: MReyes82/wo-tracker
Catalog: lib/l10n/app_*.arb
Languages: es

# navHome
source: Home
es: Inicio

# navRegister
source: Register new
es: Registrar nuevo

# navHistory
source: History
es: Historial

# navSettings
source: Settings
es: Ajustes

# homeTitle
source: My Workouts
es: Mis Entrenamientos

source: Recent Workouts
es: Entrenamientos Recientes

source: No recent workouts
es: No hay entrenamientos recientes

# noWorkoutScheduled
source: No workout scheduled for today
es: No hay entrenamiento programado para hoy

# planFirstWorkout
source: Plan your first workout
es: Planifica tu primer entrenamiento

source: Start Workout
es: Iniciar Entrenamiento

source: Plan a Workout
es: Planificar Entrenamiento

source: Today's Workout
es: Entrenamiento de Hoy

source: More
es: Más

source: Details
es: Detalles

source: Edit
es: Editar

source: Save
es: Guardar

source: Cancel
es: Cancelar

source: Delete
es: Eliminar

source: Retry
es: Reintentar

# recordsTitle
source: Records
es: Registros

source: Exercises
es: Ejercicios

source: Workouts
es: Entrenamientos

source: Mesocycles
es: Mesociclos

source: Sessions
es: Sesiones

source: Search by name...
es: Buscar por nombre...

source: No exercises found
es: No se encontraron ejercicios

# noExercisesMatch
source: No exercises match your search
es: No hay ejercicios que coincidan con tu búsqueda

source: No workouts found
es: No se encontraron entrenamientos

# noWorkoutsMatch
source: No workouts match your search
es: No hay entrenamientos que coincidan con tu búsqueda

source: No mesocycles found
es: No se encontraron mesociclos

# noMesocyclesMatch
source: No mesocycles match your search
es: No hay mesociclos que coincidan con tu búsqueda

source: No sessions found
es: No se encontraron sesiones

# noSessionsMatch
source: No sessions match your search
es: No hay sesiones que coincidan con tu búsqueda

source: Completed
es: Completado

source: No default weight
es: Sin peso predeterminado

# registerNewTitle
source: Register New
es: Registrar Nuevo

# whatToCreate
source: What would you like to create?
es: ¿Qué te gustaría crear?

source: Add Exercise
es: Agregar Ejercicio

# addExerciseDesc
source: Create a new exercise for your catalog
es: Crea un nuevo ejercicio para tu catálogo

source: Add Workout
es: Agregar Entrenamiento

# addWorkoutDesc
source: Build a workout with exercises
es: Construye un entrenamiento con ejercicios

source: Add Mesocycle
es: Agregar Mesociclo

# addMesocycleDesc
source: Plan a training cycle with multiple workouts
es: Planifica un ciclo de entrenamiento con múltiples entrenamientos

source: Manage Catalogs
es: Administrar Catálogos

# manageCatalogsDesc
source: Add exercise types, equipment, muscle groups, etc.
es: Agregar tipos de ejercicio, equipamiento, grupos musculares, etc.

# settingsTitle
source: Settings
es: Ajustes

source: Language
es: Idioma

source: Select Language
es: Seleccionar Idioma

source: English
es: Inglés

source: Spanish
es: Español

# noExercisesInWorkout
source: No exercises in this workout
es: No hay ejercicios en este entrenamiento

source: Notes saved!
es: ¡Notas guardadas!

source: No exercises available
es: No hay ejercicios disponibles

# noMoreWorkoutsTitle
source: No More Workouts
es: No Hay Más Entrenamientos

# workoutCount
source: You have completed {count} workout{plural}. Keep training to see more history!
es: Has completado {count} entrenamiento{plural}. ¡Sigue entrenando para ver más historial!

# noSetsLogged
source: No sets logged yet
es: No se han registrado series aún

# noNotesForSet
source: No notes for this set.
es: No hay notas para esta serie.

# noEffortLevel
source: No effort level recorded for this set.
es: No se registró nivel de esfuerzo para esta serie.

# noWorkoutsInMesocycle
source: No workouts in this mesocycle
es: No hay entrenamientos en este mesociclo

source: Exercise Details
es: Detalles del Ejercicio

source: Default Working Weight
es: Peso de Trabajo Predeterminado

source: Unit System
es: Sistema de Unidades

source: Metric (kg)
es: Métrico (kg)

source: Not set
es: No establecido

source: Workout Session
es: Sesión de Entrenamiento

source: weeks
es: semanas

# sessionsPerWeek
source: sessions/week
es: sesiones/semana

# createdOn
source: Created {date}
es: Creado el {date}

source: Workout Details
es: Detalles del Entrenamiento

source: Workout completed!
es: ¡Entrenamiento completado!

source: Workout not found
es: Entrenamiento no encontrado

source: ACTIVE WORKOUT
es: ENTRENAMIENTO ACTIVO

source: Workout Notes
es: Notas del Entrenamiento

source: Add Workout Notes
es: Agregar Notas del Entrenamiento

# addNotesPlaceholder
source: Add notes about your workout...
es: Agregar notas sobre tu entrenamiento...

source: Mark Start Time
es: Marcar Hora de Inicio

source: See Start Time
es: Ver Hora de Inicio

# setStartTimeNow
source: Set the workout start time to now?
es: ¿Establecer la hora de inicio del entrenamiento ahora?

source: Mark Now
es: Marcar Ahora

source: Start time marked!
es: ¡Hora de inicio marcada!

source: Workout Start Time
es: Hora de Inicio del Entrenamiento

# workoutStartedAt
source: This workout started at:
es: Este entrenamiento comenzó a las:

source: Close
es: Cerrar

source: Change Exercise
es: Cambiar Ejercicio

# exerciseChangedTo
source: Exercise changed to {name}
es: Ejercicio cambiado a {name}

# defaultLabel
source: Default
es: Predeterminado

source: New Exercise
es: Nuevo Ejercicio

source: Edit Exercise
es: Editar Ejercicio

source: Exercise Name
es: Nombre del Ejercicio

source: Exercise Type
es: Tipo de Ejercicio

source: Equipment
es: Equipamiento

source: Muscle Groups
es: Grupos Musculares

source: Save Exercise
es: Guardar Ejercicio

source: Exercise saved!
es: ¡Ejercicio guardado!

source: New Workout
es: Nuevo Entrenamiento

source: Edit Workout
es: Editar Entrenamiento

source: Workout Name
es: Nombre del Entrenamiento

source: Workout Type
es: Tipo de Entrenamiento

source: Select Exercises
es: Seleccionar Ejercicios

source: Save Workout
es: Guardar Entrenamiento

source: Workout saved!
es: ¡Entrenamiento guardado!

source: New Mesocycle
es: Nuevo Mesociclo

source: Edit Mesocycle
es: Editar Mesociclo

source: Mesocycle Name
es: Nombre del Mesociclo

source: Duration
es: Duración

source: Start Date
es: Fecha de Inicio

source: Select Workouts
es: Seleccionar Entrenamientos

source: Save Mesocycle
es: Guardar Mesociclo

source: Mesocycle saved!
es: ¡Mesociclo guardado!

source: Required
es: Requerido

source: Optional
es: Opcional

# pleaseEnter
source: Please enter {field}
es: Por favor ingrese {field}

# pleaseSelect
source: Please select {field}
es: Por favor seleccione {field}

source: End Date
es: Fecha de Fin

# session
source: Session {number}
es: Sesión {number}

source: Per Week
es: Por Semana

source: Created
es: Creado

source: Using default weight
es: Usando peso predeterminado

source: sets
es: series

source: Mesocycle Details
es: Detalles del Mesociclo

# selectWorkoutForSession
source: Please select a workout for Session {number}
es: Por favor seleccione una rutina para la Sesión {number}

# errorCreatingMesocycle
source: Error creating mesocycle: {error}
es: Error al crear mesociclo: {error}

source: Enter mesocycle name
es: Ingrese nombre del mesociclo

# weeksLabel
source: Weeks:
es: Semanas:

# sessionsPerWeekDesc
source: Number of workout sessions per week
es: Número de sesiones de entrenamiento por semana

source: Choose workout template
es: Elija plantilla de rutina

source: Amount of Training Weeks
es: Cantidad de Semanas de Entrenamiento

# selectSplit
source: Select Split (Sessions of the Week)
es: Seleccionar División (Sesiones de la Semana)

# errorLoadingExercise
source: Error loading exercise: {error}
es: Error al cargar ejercicio: {error}

# errorUpdatingExercise
source: Error updating exercise: {error}
es: Error al actualizar ejercicio: {error}

source: Enter exercise name
es: Ingrese nombre del ejercicio

source: Select exercise type
es: Seleccione tipo de ejercicio

source: Select equipment type
es: Seleccione tipo de equipamiento

source: Select muscle group
es: Seleccione grupo muscular

source: Default Working Weight (Optional)
es: Peso de Trabajo Predeterminado (Opcional)

source: Enter weight
es: Ingrese peso

# errorCreatingExercise
source: Error creating exercise: {error}
es: Error al crear ejercicio: {error}

# errorLoadingWorkout
source: Error loading workout: {error}
es: Error al cargar rutina: {error}

# errorUpdatingWorkout
source: Error updating workout: {error}
es: Error al actualizar rutina: {error}

# errorCreatingWorkout
source: Error creating workout: {error}
es: Error al crear rutina: {error}

source: Enter workout name
es: Ingrese nombre de la rutina

source: Select workout type
es: Seleccione tipo de rutina

source: Number of Exercises
es: Número de Ejercicios

source: Number of exercises to perform
es: Número de ejercicios a realizar

source: Choose exercise
es: Elija ejercicio

source: Select the {ordinal} exercise
es: Seleccione el {ordinal} ejercicio

source: Please select the {ordinal} exercise
es: Por favor seleccione el {ordinal} ejercicio

source: Please select sets for the {ordinal} exercise
es: Por favor seleccione series para el {ordinal} ejercicio

# errorLoadingMesocycle
source: Error loading mesocycle: {error}
es: Error al cargar mesociclo: {error}

# errorUpdatingMesocycle
source: Error updating mesocycle: {error}
es: Error al actualizar mesociclo: {error}

source: Training Weeks
es: Semanas de Entrenamiento

# durationOfMesocycleInWeeks
source: Duration of the mesocycle in weeks
es: Duración del mesociclo en semanas

source: Workout Schedule
es: Horario de Entrenamiento

source: Choose workout
es: Elija rutina

source: Default Weight
es: Peso Predeterminado

source: Manage your catalogs
es: Administre sus catálogos

source: Exercise Types
es: Tipos de Ejercicio

# exerciseTypesDesc
source: Compound, Isolation, etc.
es: Compuesto, Aislamiento, etc.

source: Equipment Types
es: Tipos de Equipamiento

# equipmentTypesDesc
source: Barbell, Dumbbell, Machine, etc.
es: Barra, Mancuerna, Máquina, etc.

source: Workout Types
es: Tipos de Rutina

# workoutTypesDesc
source: Push, Pull, Legs, etc.
es: Empuje, Jalón, Piernas, etc.

# muscleGroupsDesc
source: Chest, Back, Legs, etc.
es: Pecho, Espalda, Piernas, etc.

source: Add {catalog}
es: Agregar {catalog}

source: Enter name
es: Ingrese nombre

# pleaseEnterName
source: Please enter a name
es: Por favor ingrese un nombre

source: Add
es: Agregar

source: {catalog} added successfully!
es: {catalog} agregado exitosamente!

# errorAddingCatalog
source: Error adding {catalog}: {error}
es: Error al agregar {catalog}: {error}

# weeksCount
source: {count} weeks
es: {count} semanas

# sessionsPerWeekCount
source: {count} sessions/week
es: {count} sesiones/semana

source: Workout Split
es: División de Entrenamiento

source: Unknown
es: Desconocido

source: No sets logged yet
es: Aún no se han registrado series

source: Add Set
es: Agregar Serie

source: Delete Last
es: Eliminar Última

source: Add Exercise Notes
es: Agregar Notas de Ejercicio

source: See Original Planned Exercise
es: Ver Ejercicio Planeado Original

source: Exercise Notes
es: Notas de Ejercicio

# addNotesAboutExercise
source: Add notes about this exercise...
es: Agregar notas sobre este ejercicio...

source: Exercise notes saved!
es: ¡Notas de ejercicio guardadas!

source: Original Exercise
es: Ejercicio Original

# exerciseNotSwapped
source: This exercise was not swapped. It is the original planned exercise.
es: Este ejercicio no fue cambiado. Es el ejercicio planeado original.

source: Original Planned Exercise
es: Ejercicio Planeado Original

# exerciseSwappedDuringWorkout
source: This exercise was swapped during the workout
es: Este ejercicio fue cambiado durante el entrenamiento

source: Performed Exercise:
es: Ejercicio Realizado:

source: Originally Planned:
es: Planeado Originalmente:

source: Planned Exercise:
es: Ejercicio Planeado:

# exerciseChangedToSuitNeeds
source: Exercise was changed to better suit workout needs
es: Ejercicio cambiado para ajustarse mejor a las necesidades del entrenamiento
